import random
v= ['6*9=', '5*2=', '9*9=', '4*7=', '3*6=', '7*9=', '2*8=', '8*3=', '6*6=', '5*5', '6+9=', '5+2=', '9+9=', '4+7=', '3+6=', '7+9=', '2+8=', '8+3=', '6+6=', '5+5=']
o = [54, 14, 81, 28, 18, 63, 16, 24, 36, 25, 15, 7, 18, 11, 9, 16, 10, 11, 12, 10]
posres = 0
for ii in range(10) :
    i = random.randint(0,20 - ii)
    d = v[i]
    j = v.index(d)
    d1 = o[j]
    del v[j]
    del o[j]
    print("сколько будет? : {}".format(d))
    if int(input()) == d1 :
        posres += 1
print("верных ответов :", posres)